.emacs.d/config.org
#+TITLE Emacs Config
* Base Config
This is my personal emacs config
** config/path
Returns full path to file relative to config directory
#+BEGIN_SRC emacs-lisp
  (defun config/path(path)
    (concat user-emacs-directory path))
#+END_SRC
** config/reload
Reloads config when called
#+BEGIN_SRC emacs-lisp
  (defun config/reload()
    (interactive)
    (org-babel-load-file (config/path "config.org")))
#+END_SRC
* Package config
** require package
#+BEGIN_SRC emacs-lisp
  (require 'package)
#+END_SRC
** initialize package and add package archives
#+BEGIN_SRC emacs-lisp
  (package-initialize)
  (setq package-archives '(("melpa" . "http://melpa.org/packages/")
                           ("elpa" . "http://elpa.gnu.org/packages/")))
#+END_SRC
** install use-package
#+BEGIN_SRC emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
#+END_SRC
** package-use
A simple function that installs and requires packages
#+BEGIN_SRC emacs-lisp
  (defun package-use(name &rest args)
    (unless (package-installed-p name)
      (package-install name))
    (setq arg-require (plist-get args :require))
    (setq arg-require-name (plist-get args :require-name))
    (if arg-require
        (require name)
      (when arg-require-name
        (require arg-require-name))))
#+END_SRC
* General customiztions
Don't play annoying sounds
#+BEGIN_SRC emacs-lisp
  (setq ring-bell-function 'ignore)
#+END_SRC
Disable useless UI elements
#+BEGIN_SRC emacs-lisp
  (ignore-errors (tool-bar-mode 0))
  (ignore-errors (menu-bar-mode 0))
  (ignore-errors (scroll-bar-mode 0))
  (add-hook 'after-init-hook (lambda() (interactive) (ignore-errors (scroll-bar-mode 0))))
#+END_SRC
Disable autosaving
#+BEGIN_SRC emacs-lisp
  (setq make-backup-files nil)
  (setq auto-save-default nil)
#+END_SRC
Enable electric-pair mode
#+BEGIN_SRC emacs-lisp
  (electric-pair-mode 1)
#+END_SRC
Enable line numbers
#+BEGIN_SRC emacs-lisp
  (global-linum-mode 1)
  (setq linum-format " %d ")
#+END_SRC
Enable text wrapping (visual lines)
#+BEGIN_SRC emacs-lisp
  (global-visual-line-mode 1)
#+END_SRC
Setup indent width (and use spaces instead of tabs)
#+BEGIN_SRC emacs-lisp
  (setq config/indent-size 2)
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width config/indent-size)
#+END_SRC
Set scroll step to 1 for smoother scrolling
#+BEGIN_SRC emacs-lisp
  (setq-default scroll-step 1)
#+END_SRC
Automatically revert buffers and disable revert messages
#+BEGIN_SRC emacs-lisp
  (setq auto-revert-verbose nil)
  (global-auto-revert-mode)
#+END_SRC
Use y-n instead of yes-no
#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
* Packages
** general
#+BEGIN_SRC emacs-lisp
  (package-use 'general :require t)
#+END_SRC
** which-key
#+BEGIN_SRC emacs-lisp
  (package-use 'which-key :require t)
  (which-key-mode 1)
#+END_SRC
** swiper
#+BEGIN_SRC emacs-lisp
  (package-use 'swiper :require t)
#+END_SRC
** company
#+BEGIN_SRC emacs-lisp
  (package-use 'company :require t)
#+END_SRC
** projectile
#+BEGIN_SRC emacs-lisp
  (package-use 'projectile :require t)
  (projectile-global-mode 1)
#+END_SRC
** ivy
#+BEGIN_SRC emacs-lisp
  (package-use 'ivy :require t)
  (ivy-mode 1)
#+END_SRC
** beacon
#+BEGIN_SRC emacs-lisp
  (package-use 'beacon :require t)
  (beacon-mode 1)
#+END_SRC
** highlight parentheses
#+BEGIN_SRC emacs-lisp
  (package-use 'highlight-parentheses :require t)
  (global-highlight-parentheses-mode)
#+END_SRC
** dashboard
#+BEGIN_SRC emacs-lisp
  (package-use 'dashboard :require t)
  (dashboard-setup-startup-hook)
  (setq dashboard-startup-banner (config/path "banner.png"))
  (setq dashboard-items '((recents . 5)
        (projects . 5)))
  (setq dashboard-banner-logo-title "Welcome to Emacs.")
#+END_SRC
** minor-mode-hack
#+BEGIN_SRC emacs-lisp
  (package-use 'minor-mode-hack :require t)
#+END_SRC
** avy
#+BEGIN_SRC emacs-lisp
  (package-use 'avy :require t)
#+END_SRC
** elmacro
#+BEGIN_SRC emacs-lisp
  (package-use 'elmacro :require t)
  (elmacro-mode 1)
#+END_SRC
** exwm
#+BEGIN_SRC emacs-lisp
  (package-use 'exwm :require t)
#+END_SRC
** undo-tree
#+BEGIN_SRC emacs-lisp
  (package-use 'undo-tree :require t)
  (global-undo-tree-mode)
#+END_SRC
** expand-region
#+BEGIN_SRC emacs-lisp
  (package-use 'expand-region :require t)
#+END_SRC
** multiple-cursors
#+BEGIN_SRC emacs-lisp
  (package-use 'multiple-cursors :require t)
#+END_SRC
** flycheck
#+BEGIN_SRC emacs-lisp
  (package-use 'flycheck :require t)
  (global-flycheck-mode t)
#+END_SRC
Disable overlay and change fringe shape
#+BEGIN_SRC emacs-lisp
  (define-fringe-bitmap 'flycheck-fringe-bitmap-rectangle
    (vector #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000
            #b11100000))

  (flycheck-define-error-level 'error
    ;;:overlay-category 'flycheck-error-overlay
    :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
    :fringe-face 'flycheck-fringe-error
    :error-list-face 'flycheck-error-list-error)

  (flycheck-define-error-level 'warning
    ;;:overlay-category 'flycheck-warning-overlay
    :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
    :fringe-face 'flycheck-fringe-warning
    :error-list-face 'flycheck-error-list-warning)

  (flycheck-define-error-level 'info
    ;;:overlay-category 'flycheck-info-overlay
    :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
    :fringe-face 'flycheck-fringe-info
    :error-list-face 'flycheck-error-list-info)
#+END_SRC
Disable minibuffer messages about errors
#+BEGIN_SRC emacs-lisp
  (setq flycheck-display-errors-function nil)
#+END_SRC
** origami
#+BEGIN_SRC emacs-lisp
  (package-use 'origami :require t)
  (global-origami-mode t)
#+END_SRC
* Programming Languages
