.emacs.d/config.el
(defun config/path(path)
  (concat user-emacs-directory path))

(defun config/reload()
  (interactive)
  (org-babel-load-file (config/path "config.org")))

(require 'package)

(package-initialize)
(setq package-archives '(("melpa" . "http://melpa.org/packages/")
                         ("elpa" . "http://elpa.gnu.org/packages/")))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

(defun package-use(name &rest args)
  (unless (package-installed-p name)
    (package-install name))
  (setq arg-require (plist-get args :require))
  (setq arg-require-name (plist-get args :require-name))
  (if arg-require
      (require name)
    (when arg-require-name
      (require arg-require-name))))

(setq ring-bell-function 'ignore)

(ignore-errors (tool-bar-mode 0))
(ignore-errors (menu-bar-mode 0))
(ignore-errors (scroll-bar-mode 0))
(add-hook 'after-init-hook (lambda() (interactive) (ignore-errors (scroll-bar-mode 0))))

(setq make-backup-files nil)
(setq auto-save-default nil)

(electric-pair-mode 1)

(global-linum-mode 1)
(setq linum-format " %d ")

(global-visual-line-mode 1)

(setq config/indent-size 2)
(setq-default indent-tabs-mode nil)
(setq-default tab-width config/indent-size)

(setq-default scroll-step 1)

(setq auto-revert-verbose nil)
(global-auto-revert-mode)

(defalias 'yes-or-no-p 'y-or-n-p)

(package-use 'general :require t)

(package-use 'which-key :require t)
(which-key-mode 1)

(package-use 'swiper :require t)

(package-use 'company :require t)

(package-use 'projectile :require t)
(projectile-global-mode 1)

(package-use 'ivy :require t)
(ivy-mode 1)

(package-use 'beacon :require t)
(beacon-mode 1)

(package-use 'highlight-parentheses :require t)
(global-highlight-parentheses-mode)

(package-use 'dashboard :require t)
(dashboard-setup-startup-hook)
(setq dashboard-startup-banner (config/path "banner.png"))
(setq dashboard-items '((recents . 5)
      (projects . 5)))
(setq dashboard-banner-logo-title "Welcome to Emacs.")

(package-use 'minor-mode-hack :require t)

(package-use 'avy :require t)

(package-use 'elmacro :require t)
(elmacro-mode 1)

(package-use 'exwm :require t)

(package-use 'undo-tree :require t)
(global-undo-tree-mode)

(package-use 'expand-region :require t)

(package-use 'multiple-cursors :require t)

(package-use 'flycheck :require t)
(global-flycheck-mode t)

(define-fringe-bitmap 'flycheck-fringe-bitmap-rectangle
  (vector #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000
          #b11100000))

(flycheck-define-error-level 'error
  ;;:overlay-category 'flycheck-error-overlay
  :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
  :fringe-face 'flycheck-fringe-error
  :error-list-face 'flycheck-error-list-error)

(flycheck-define-error-level 'warning
  ;;:overlay-category 'flycheck-warning-overlay
  :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
  :fringe-face 'flycheck-fringe-warning
  :error-list-face 'flycheck-error-list-warning)

(flycheck-define-error-level 'info
  ;;:overlay-category 'flycheck-info-overlay
  :fringe-bitmap 'flycheck-fringe-bitmap-rectangle
  :fringe-face 'flycheck-fringe-info
  :error-list-face 'flycheck-error-list-info)

(setq flycheck-display-errors-function nil)

(package-use 'origami :require t)
(global-origami-mode t)
