.emacs.d/config.org
** Lua
Lua mode
#+BEGIN_SRC emacs-lisp
  (package-use 'lua-mode :require t)
#+END_SRC
Lua mode for company
#+BEGIN_SRC emacs-lisp
  (package-use 'company-lua :require t)
  (eval-after-load 'company
    '(add-to-list 'company-backends 'company-lua))
#+END_SRC
Set Lua indentation width
#+BEGIN_SRC emacs-lisp
  (setq lua-indent-level tab-width)
#+END_SRC
Fix for broken lua-mode indentation
#+BEGIN_SRC emacs-lisp
  (defun lua-calculate-modifier (modifier)
    (if (= modifier 0)
        0
      lua-indent-level))

  (defun lua-calculate-indentation (&optional parse-start)
    (save-excursion
      (let ((continuing-p (lua-is-continuing-statement-p))
            (cur-line-begin-pos (line-beginning-position)))
        (or
         (lua-calculate-indentation-override)

         (when (lua-forward-line-skip-blanks 'back)
           (let* ((modifier
                   (lua-calculate-indentation-block-modifier cur-line-begin-pos)))
             (+ (current-indentation) (lua-calculate-modifier modifier))))
         0))))

  (defun lua-calculate-indentation-override (&optional parse-start)
    "Return overriding indentation amount for special cases.
  Look for an uninterrupted sequence of block-closing tokens that starts
  at the beginning of the line. For each of these tokens, shift indentation
  to the left by the amount specified in lua-indent-level."
    (let ((indentation-modifier 0)
          (case-fold-search nil)
          (block-token nil))
      (save-excursion
        (if parse-start (goto-char parse-start))
        ;; Look for the last block closing token
        (back-to-indentation)
        (if (and (not (lua-comment-or-string-p))
                 (looking-at lua-indentation-modifier-regexp)
                 (let ((token-info (lua-get-block-token-info (match-string 0))))
                   (and token-info
                        (not (eq 'open (lua-get-token-type token-info))))))
            (when (lua-goto-matching-block-token nil nil 'backward)
              ;; Exception cases: when the start of the line is an assignment,
              ;; go to the start of the assignment instead of the matching item
              (let ((block-start-column (current-column))
                    (block-start-point (point)))
                (if (lua-point-is-after-left-shifter-p)
                    (current-indentation)
                  block-start-column)))))))

  (defun lua-calculate-indentation-override (&optional parse-start)
    "Return overriding indentation amount for special cases.
  Look for an uninterrupted sequence of block-closing tokens that starts
  at the beginning of the line. For each of these tokens, shift indentation
  to the left by the amount specified in lua-indent-level."
    (let ((indentation-modifier 0)
          (case-fold-search nil)
          (block-token nil))
      (save-excursion
        (if parse-start (goto-char parse-start))
        ;; Look for the last block closing token
        (back-to-indentation)
        (if (and (not (lua-comment-or-string-p))
                 (looking-at lua-indentation-modifier-regexp)
                 (let ((token-info (lua-get-block-token-info (match-string 0))))
                   (and token-info
                        (not (eq 'open (lua-get-token-type token-info))))))
            (when (lua-goto-matching-block-token)
              ;; Exception cases: when the start of the line is an assignment,
              ;; go to the start of the assignment instead of the matching item
              (let ((block-start-column (current-column))
                    (block-start-point (point)))
                (if (lua-point-is-after-left-shifter-p)
                    (current-indentation)
                  (current-indentation))))))))

#+END_SRC
** MoonScript
Install moonscript mode
#+BEGIN_SRC emacs-lisp
  (package-use 'moonscript :require t)
#+END_SRC
** C/C++
Install irony, a c/c++ completion package
#+BEGIN_SRC emacs-lisp
  (package-use 'irony :require t)
  (package-use 'company-irony :require t)
  (package-use 'company-c-headers :require t)
#+END_SRC
Adds hooks to both c and c++ mode
#+BEGIN_SRC emacs-lisp
  (defun lang-c/add-hook (func-name)
    (add-hook 'c++-mode-hook func-name)
    (add-hook 'c-mode-hook func-name))
#+END_SRC
Initialize irony if current system isn't windows
#+BEGIN_SRC emacs-lisp
  (when (not (string-equal system-type "windows-nt"))
    (lang-c/add-hook 'irony-mode))
#+END_SRC
Use gcc flycheck checker instead of clang
#+BEGIN_SRC emacs-lisp
  (defun lang-c/change-checker()
    (add-to-list 'flycheck-disabled-checkers 'c/c++-clang)
    (add-to-list 'flycheck-enabled-checkers 'c/c++-gcc)
    (delete 'c/c++-clang flycheck-enabled-checkers))

  (lang-c/add-hook 'lang-c/change-checker)
#+END_SRC
** Shell Script
#+BEGIN_SRC emacs-lisp
  (setq-default sh-basic-offset tab-width)
#+END_SRC
** D
Install d mode package
#+BEGIN_SRC emacs-lisp
  (package-use 'd-mode :require t)
#+END_SRC
* Modal
This is a custom implementation of modal editing, similiar to vim's, including normal, insert, and region mode
** make-normal-sparse-keymap
Returns a keymap, where all the self-inserting characters are ignored
#+BEGIN_SRC emacs-lisp
  (setq self-inserting-characters '("`" "1" "2" "3" "4" "5" "6" "7" "8" "9" "0" "-" "=" "q" "w" "e" "r" "t" "y" "u" "i" "o" "p" "[" "]" "a" "s" "d" "f" "g" "h" "j" "k" "l" ";" "'" "\\" "z" "x" "c" "v" "b" "n" "m" "," "." "/" "TAB" "SPC" "<tab>" "<space>" "~" "@" "#" "$" "%" "^" "&" "*" "(" ")" "_" "+" "Q" "W" "E" "R" "T" "Y" "U" "I" "O" "P" "{" "}" "A" "S" "D" "F" "G" "H" "J" "K" "L" ":" "\"" "|" ">" "Z" "X" "C" "V" "B" "N" "M" "<" ">" "?" "DEL"))

  (defun make-normal-sparse-keymap()
    (setq result (make-sparse-keymap))
    (dolist (char self-inserting-characters)
      (define-key result (kbd char) 'ignore))
    result)
#+END_SRC
** modal editing implementation
Some variables
#+BEGIN_SRC emacs-lisp
  (setq modal/ignored-major-modes (list "dired-mode" "eshell-mode" "ibuffer-mode"))
#+END_SRC

Maps for each mode
#+BEGIN_SRC emacs-lisp
  (setq modal/emacs-map (make-sparse-keymap))
  (setq modal/normal-map (make-sparse-keymap))
  (setq modal/insert-map (make-sparse-keymap))
  (setq modal/region-map (make-sparse-keymap))
  (setq modal/rectangle-map (make-sparse-keymap))
  (setq modal/multiple-cursors-map (make-sparse-keymap))
#+END_SRC
Create minor modes for every editing mode
#+BEGIN_SRC emacs-lisp
  (defun modal/initialize()
    (define-minor-mode modal/normal-mode "Normal mode" nil "<Normal>" modal/normal-map)
    (define-minor-mode modal/emacs-mode "Emacs mode" nil "<Emacs>" modal/emacs-map)
    (define-minor-mode modal/insert-mode "Insert mode" nil "<Insert>" modal/insert-map)
    (define-minor-mode modal/region-mode "Region mode" nil "<Region>" modal/region-map)
    (define-minor-mode modal/rectangle-mode "Rectangle mode" nil "<Rectangle>" modal/rectangle-map)
    (define-minor-mode modal/multiple-cursors-mode nil nil nil modal/multiple-cursors-map
      (if modal/multiple-cursors-mode
          (raise-minor-mode-map-alist 'modal/multiple-cursors-mode))))
#+END_SRC
Functions to manage editing modes
#+BEGIN_SRC emacs-lisp
  (defun modal/clear()
    (interactive)
    (modal/normal-mode 0)
    (modal/emacs-mode 0)
    (modal/insert-mode 0)
    (modal/region-mode 0)
    (modal/rectangle-mode 0))
  (defun modal/enable-normal()
    (interactive)
    (modal/clear)
    (setq cursor-type 'box)
    (modal/normal-mode 1))
  (defun modal/enable-insert()
    (interactive)
    (modal/clear)
    (setq cursor-type 'bar)
    (modal/insert-mode 1))
  (defun modal/enable-emacs()
    (interactive)
    (modal/clear)
    (setq cursor-type 'box)
    (modal/emacs-mode 1))
  (defun modal/enable-region()
    (interactive)
    (modal/clear)
    (setq cursor-type 'box)
    (modal/region-mode 1))
  (defun modal/enable-rectangle()
    (interactive)
    (modal/clear)
    (setq cursor-type 'box)
    (modal/rectangle-mode 1))
#+END_SRC

Create global modal-mode
#+BEGIN_SRC emacs-lisp
  (define-minor-mode modal-mode "Mode that enbles modes on buffer" t "<Modal>" nil
    (when modal-mode
      (if (not (or (minibufferp)
                   (member (symbol-name major-mode) modal/ignored-major-modes)))
          (modal/enable-normal)
        (modal/enable-emacs))))

  (define-global-minor-mode global-modal-mode modal-mode (lambda() (modal-mode 1)))
#+END_SRC

* Editing functions
