.emacs.d/config.org
** surround
Functions that surround a region with an opening and closing string
#+BEGIN_SRC emacs-lisp
  (defun edit/surround(start end open close)
    (save-excursion
      (goto-char start)
      (insert open)
      (goto-char (+ end 1))
      (insert close)))

  (defun edit/surround-region(open close)
    (when (region-active-p)
      (edit/surround (region-beginning) (region-end) open close)))
#+END_SRC
** other misc. editing functions
#+BEGIN_SRC emacs-lisp
  (defun edit/insert-after()
    (interactive)
    (forward-char)
    (modal/enable-insert))

  (defun edit/insert-end-of-line()
    (interactive)
    (end-of-line)
    (modal/enable-insert))

  (defun edit/insert-beginning-of-line()
    (interactive)
    (beginning-of-line)
    (modal/enable-insert))

  (defun edit/set-region()
    (interactive)
    (set-mark (point))
    (modal/enable-region))

  (defun edit/set-region-line()
    (interactive)
    (beginning-of-line)
    (set-mark (point))
    (end-of-line)
    (modal/enable-region))

  (defun edit/open-line()
    (interactive)
    (end-of-line)
    (open-line 1)
    (next-line))

  (defun edit/open-line-above()
    (interactive)
    (beginning-of-line)
    (open-line 1))

  (defun edit/yank-line()
    (interactive)
    (save-excursion
      (edit/open-line)
      (yank)
      (delete-blank-lines)))

  (defun edit/kill-whole-word()
    (interactive)
    (backward-char)
    (forward-word)
    (backward-kill-word 1))

  (defun edit/copy-whole-line()
    (interactive)
    (save-excursion
      (kill-whole-line)
      (yank)))

  (defun edit/yank-region()
    (interactive)
    (kill-region (region-beginning) (region-end))
    (yank 2)
    (modal/enable-normal))

  (defun edit/insert-mark()
    (interactive)
    (insert "<++>"))

  (defun edit/goto-mark()
    (interactive)
    (search-forward "<++>")
    (search-backward "<")
    (delete-char  4)
    (modal/enable-insert))
#+END_SRC
Use default org folding if in org mode
#+BEGIN_SRC emacs-lisp
  (defun edit/fold-toggle()
    (interactive)
    (if (string-equal major-mode "org-mode")
        (org-cycle)
      (origami-toggle-node (current-buffer) (point))))
#+END_SRC
* Misc. functions
** macro-make-functions
Evaluates a elmacro generated defun
#+BEGIN_SRC emacs-lisp
  (defun macro-make-function(&optional name)
    (interactive)
    (if (called-interactively-p 'any)
        (setq name (read-string "Macro name: "))
      (setq name (if name name "last-macro")))
    (setq function-string (pp-to-string (elmacro-make-defun (make-symbol (concat "macros/" name)) (elmacro-extract-last-macro elmacro-command-history))))
    (message function-string)
    (set-buffer (generate-new-buffer "*temporaryMacroBuffer*"))
    (erase-buffer)
    (insert function-string)
    (eval-buffer)
    (message function-string)
    (kill-buffer "*temporaryMacroBuffer*"))
#+END_SRC
* Eshell
** eshell/get-last-eshell-buffer
Returns the most recently used eshell buffer
#+BEGIN_SRC emacs-lisp
  (defun eshell/get-last-eshell-buffer()
    (catch 'buffer
      (dolist (buffer (buffer-list))
        (when (cl-search "*eshell*" (buffer-name buffer))
          (throw 'buffer buffer)))))
#+END_SRC
** eshell/switch-to-last-eshell-buffer
Switches to most recent eshell buffer or creates a new one
#+BEGIN_SRC emacs-lisp
  (defun eshell/switch-to-last-eshell-buffer()
    (let ((buffer (eshell/get-last-eshell-buffer)))
      (if buffer
          (switch-to-buffer buffer)
        (eshell))))
#+END_SRC
** eshell/toggle
Switches to eshell if the current buffer isn't an eshell buffer, else returns to previous buffer
#+BEGIN_SRC emacs-lisp
  (defun eshell/toggle()
    (interactive)
    (if (cl-search "*eshell" (buffer-name))
        (switch-to-prev-buffer)
      (eshell/switch-to-last-eshell-buffer)))
#+END_SRC
** eshell-new
Creates a new numbered eshell buffer
#+BEGIN_SRC emacs-lisp
  (setq eshell/new-count 1)
  (defun eshell/new()
    (interactive)
    (eshell eshell/new-count)
    (setq eshell/new-count (+ 1 eshell/new-count)))
#+END_SRC
** misc.
Disable linum mode in eshell
#+BEGIN_SRC emacs-lisp
  (add-hook 'eshell-mode-hook (lambda() (interactive) (linum-mode 0)))
#+END_SRC
* Keybindings
** Globals
#+BEGIN_SRC emacs-lisp
  (general-define-key
   "C-x =" 'macro-make-function
   "C-x C-b" 'ibuffer)
#+END_SRC
** Leader
#+BEGIN_SRC emacs-lisp
  (general-create-definer general-leader-define-key
    :prefix "C-c")

  (general-leader-define-key
    "RET" 'eshell/toggle
    "<return>" 'eshell/toggle
    "C-RET" 'eshell/new
    "C-<return>" 'eshell/new
    "e b" 'eval-buffer
    "e r" 'eval-region
    "e e" 'eval-expression)
#+END_SRC
** emacs-mode map
#+BEGIN_SRC emacs-lisp
  (general-define-key
   :keymaps 'modal/emacs-map
   "<escape>" (kbd "C-g")
   "M-g" (kbd "C-g")
   "M-q" 'modal/enable-normal
   "M-e" 'modal/enable-emacs)
#+END_SRC
** normal bare map
Used as a base for other maps
#+BEGIN_SRC emacs-lisp
  (setq modal/normal-bare-map (make-sparse-keymap))

  (general-define-key
   :keymaps 'modal/normal-bare-map
   "k" 'previous-line
   "K" 'scroll-down-command
   "j" 'next-line
   "J" 'scroll-up-command
   "h" 'backward-char
   "H" 'backward-word
   "l" 'forward-char
   "L" 'forward-word
   "a" 'beginning-of-line
   "f" 'end-of-line
   "SPC SPC" 'execute-extended-command
   "SPC s" 'save-some-buffers
   "SPC b" 'ivy-switch-buffer
   "SPC f" 'find-file
   "SPC d" 'dired
   "SPC k" 'kill-buffer
   "SPC RET" 'eshell/toggle
   "SPC S-RET" 'eshell/new)
#+END_SRC
** normal-mode map
#+BEGIN_SRC emacs-lisp
  (setq modal/normal-map (make-composed-keymap (list (copy-keymap modal/emacs-map) (copy-keymap modal/normal-bare-map)) (make-normal-sparse-keymap)))

  (general-define-key
   :keymaps 'modal/normal-map
   "q" 'modal/enable-insert
   "Q" 'edit/insert-beginning-of-line
   "r" 'edit/insert-after
   "R" 'edit/insert-end-of-line
   "e" 'edit/set-region
   "E" 'edit/set-region-line
   "s" 'edit/copy-whole-line
   "d" (kbd "C-d")
   "D" 'kill-whole-line
   "w" 'yank
   "W" 'edit/yank-line
   "/" 'swiper
   "u" 'undo-tree-undo
   "U" 'undo-tree-redo
   "n" 'edit/open-line
   "N" (lambda() (interactive) (edit/open-line) (modal/enable-insert))
   "p" 'edit/open-line-above
   "P" (lambda() (interactive) (edit/open-line-above) (modal/enable-insert))
   "g" nil
   "g l" 'isearch-forward
   "g h" 'isearch-backward
   "g c" 'avy-goto-char
   "g l" 'avy-goto-line
   "m" 'edit/insert-mark
   "M" 'edit/goto-mark
   "TAB" 'edit/fold-toggle
   "<tab>" 'edit/fold-toggle)
#+END_SRC
** region-mode map
#+BEGIN_SRC emacs-lisp
  (setq modal/region-map (make-composed-keymap (list (copy-keymap modal/emacs-map) (copy-keymap modal/normal-bare-map)) (make-normal-sparse-keymap)))

  (general-define-key
   :keymaps 'modal/region-map
   "t" (lambda() (interactive) (kill-region (region-beginning) (region-end)) (modal/enable-insert))
   "s" (lambda() (interactive) (copy-region-as-kill (region-beginning) (region-end)) (modal/enable-normal))
   "d" (lambda() (interactive) (kill-region (region-beginning) (region-end)) (modal/enable-normal))
   "w" 'edit/yank-region
   "C-g" (lambda() (interactive) (pop-mark) (modal/enable-normal))
   "M-q" (lambda() (interactive) (pop-mark) (modal/enable-normal))
   "<escape>" (lambda() (interactive) (pop-mark) (modal/enable-normal))
   "e" 'er/expand-region
   "TAB" (lambda() (interactive) (indent-region (region-beginning) (region-end)) (modal/enable-normal))
   "<tab>" (lambda() (interactive) (indent-region (region-beginning) (region-end)) (modal/enable-normal))
   "g" nil
   "g l" 'isearch-forward
   "g h" 'isearch-backward
   ";" 'comment-or-uncomment-region
   "o" nil
   "m" (lambda() (interactive) (modal/multiple-cursors-mode 1))
   "o (" (lambda() (interactive) (edit/surround-region "(" ")") (modal/enable-normal))
   "o o" (lambda() (interactive) (edit/surround-region (read-from-minibuffer "left: ") (read-from-minibuffer "right: ")) (modal/enable-normal))
   "o )" (lambda() (interactive) (edit/surround-region "(" ")") (modal/enable-normal))
   "o {" (lambda() (interactive) (edit/surround-region "{" "}") (modal/enable-normal))
   "o }" (lambda() (interactive) (edit/surround-region "{" "}") (modal/enable-normal))
   "o [" (lambda() (interactive) (edit/surround-region "[" "]") (modal/enable-normal))
   "o ]" (lambda() (interactive) (edit/surround-region "[" "]") (modal/enable-normal))
   "o \"" (lambda() (interactive) (edit/surround-region "\"" "\"") (modal/enable-normal))
   "o <" (lambda() (interactive) (edit/surround-region "<" ">") (modal/enable-normal))
   "o '" (lambda() (interactive) (edit/surround-region "'" "'") (modal/enable-normal)))

#+END_SRC
