.emacs.d/config.org
** insert-mode map
This is the same as emacs-map
#+BEGIN_SRC emacs-lisp
  (setq modal/insert-map (copy-keymap modal/emacs-map))

  (general-define-key
   :keymaps 'modal/insert-map
   "C-g" 'modal/enable-normal)
#+END_SRC
** company-active-map
#+BEGIN_SRC emacs-lisp
  (general-define-key
   :keymaps 'company-active-map
   "<tab>" 'company-complete
   "TAB" 'company-complete)
#+END_SRC
** eshell map
#+BEGIN_SRC emacs-lisp
  (defun set-eshell-custom-map()
    (general-leader-define-key
      :keymaps 'eshell-mode-map
      "RET" 'eshell/toggle
      "<return>" 'eshell/toggle))

  (add-hook 'eshell-mode-hook 'set-eshell-custom-map)
#+END_SRC
** multiple-cursors map
#+BEGIN_SRC emacs-lisp
  (setq modal/multiple-cursors-map (make-normal-sparse-keymap))

  (general-define-key
   :keymaps 'modal/multiple-cursors-map
   "n" 'mc/mark-next-like-this
   "p" 'mc/mark-pop
   "a" 'mc/mark-all-like-this
   "r" 'mc/mark-in-region
   "q" (lambda() (interactive) (modal/multiple-cursors-mode 0))
   "M-q" (lambda() (interactive) (modal/multiple-cursors-mode 0))
   "C-g" (lambda() (interactive) (modal/multiple-cursors-mode 0)))
#+END_SRC
** dired-mode map
#+BEGIN_SRC emacs-lisp
  (setq dired-mode-map (make-composed-keymap (list (copy-keymap modal/normal-bare-map)) dired-mode-map))

  (general-define-key
   :keymaps 'dired-mode-map)
#+END_SRC
** ivy minibuffer map
#+BEGIN_SRC emacs-lisp
  (general-define-key
   :keymaps 'ivy-minibuffer-map
   "M-j" 'ivy-next-line
   "M-k" 'ivy-previous-line
   "RET" 'ivy-immediate-done
   "TAB" 'ivy-partial-or-done)
#+END_SRC
** initialize modal mode
#+BEGIN_SRC emacs-lisp
  (modal/initialize)
  (global-modal-mode t)
#+END_SRC
* Theme
** all-the-icons
#+BEGIN_SRC emacs-lisp
  (package-use 'all-the-icons :require t)
  (package-use 'all-the-icons-dired :require t)
#+END_SRC
** doom-modeline
#+BEGIN_SRC emacs-lisp
  (package-use 'doom-modeline :require t)
  (setq doom-modeline-height 32)
  (doom-modeline-mode 1)
#+END_SRC
** theme for tty, where gui is unavailable
#+BEGIN_SRC emacs-lisp
  (defun theme/tty()
    (set-face-attribute 'company-tooltip nil
            :background "#FFFFFF"))
#+END_SRC
** theme for gui
#+BEGIN_SRC emacs-lisp
  (defun theme/gui()
    (interactive)
    (package-use 'kaolin-themes)
    (setq x-theme-name (x-get-resource "themeName" "emacs"))
    (if x-theme-name
        (load-theme (intern x-theme-name) t)
      (load-theme 'kaolin-ocean t))
    (global-hl-line-mode)
    (when nil
      (set-face-attribute 'default nil
        :background "#121212"
        :foreground "#FFFFFF")
      (set-face-attribute 'mode-line nil
        :background "#202020")
      (set-face-attribute 'linum nil
        :foreground "#AAAAAA")
      (set-face-attribute 'region nil
        :background "#202040")
      (set-face-attribute 'hl-line nil
        :background "#202020")
      (set-face-attribute 'cursor nil
        :background "#CCCCCC"
        :foreground "#151515")
      )


    (setq font-name "monospace")
    (setq x-font-name (x-get-resource "fontName" "emacs"))
    (setq backup-fonts '("Cascadia Mono" "Consolas"))

    (if x-font-name
        (setq font-name x-font-name)
      (progn
        (catch 'loop
          (dolist (font backup-fonts)
            (when (find-font (font-spec :name font))
              (setq font-name font)
              (throw 'loop nil))))))

  
    (set-face-attribute 'default nil
                        :family font-name
                        :height 112)
    (set-face-attribute 'linum nil
                        :height 112))
#+END_SRC
** initialize theme
#+BEGIN_SRC emacs-lisp
  (if (and (display-graphic-p) (not (daemonp)))
      (theme/gui)
    (theme/tty))
#+END_SRC
